function OnButtonClick() {
    const exp_table = [
     [0,0]
    ,[1000,200]
    ,[2325,465]
    ,[4025,805]
    ,[6175,1235]
    ,[8800,1760]
    ,[11950,2390]
    ,[15675,3135]
    ,[20025,4005]
    ,[25025,5005]
    ,[30725,6145]
    ,[37175,7435]
    ,[44400,8880]
    ,[52450,10490]
    ,[61375,12275]
    ,[71200,14240]
    ,[81950,16390]
    ,[93675,18735]
    ,[106400,21280]
    ,[120175,24035]
    ,[135050,47010]
    ,[151850,50370]
    ,[169850,53970]
    ,[189100,57820]
    ,[209650,61930]
    ,[231525,66305]
    ,[254775,70955]
    ,[279425,75885]
    ,[305525,81105]
    ,[333100,86620]
    ,[362200,92440]
    ,[392850,98570]
    ,[425100,105020]
    ,[458975,111795]
    ,[494525,118905]
    ,[531775,126355]
    ,[570750,134150]
    ,[611500,142300]
    ,[654075,150815]
    ,[698500,159700]
    ,[744800,208960]
    ,[795425,219085]
    ,[848125,229625]
    ,[902900,240580]
    ,[959800,251960]
    ,[1018875,263775]
    ,[1080150,276030]
    ,[1143675,288735]
    ,[1209475,301895]
    ,[1277600,315520]
    ,[1348075,389615]
    ,[1424575,404915]
    ,[1503625,420725]
    ,[1585275,437055]
    ,[1669550,453910]
    ,[1756500,471300]
    ,[1846150,489230]
    ,[1938550,507710]
    ,[2033725,526745]
    ,[2131725,546345]
    ,[2232600,646520]
    ,[2341550,668310]
    ,[2453600,690720]
    ,[2568775,713755]
    ,[2687100,737420]
    ,[2808625,761725]
    ,[2933400,786680]
    ,[3061475,812295]
    ,[3192875,838575]
    ,[3327650,865530]
    ,[3465825,993165]
    ,[3614525,1022905]
    ,[3766900,1053380]
    ,[3922975,1084595]
    ,[4082800,1116560]
    ,[4246400,1149280]
    ,[4413825,1182765]
    ,[4585125,1217025]
    ,[4760350,1252070]
    ,[4939525,1287905]
    ];

    let org = document.getElementById("input_org").value - 1;
    let nxt = document.getElementById("input_nxt").value - 1;
    if(org == -1)org = 0;
    if(nxt == -1)nxt = 0;
    if(org >= 0 && org < exp_table.length && nxt >= 0 && nxt < exp_table.length && org <= nxt){
        let result_table = document.getElementById("result_table");
        let result_exp = exp_table[nxt][0] - exp_table[org][0];
        let result_mor = exp_table[nxt][1] - exp_table[org][1];
        result_table.rows[1].cells[0].firstChild.data = Math.ceil(result_exp / 20000);
        result_table.rows[1].cells[1].firstChild.data = Math.ceil(result_exp /  5000);
        result_table.rows[1].cells[2].firstChild.data = Math.ceil(result_exp /  1000);
        result_table.rows[1].cells[3].firstChild.data = result_mor.toLocaleString('ja-JP');
    }else{
        result_table.rows[1].cells[0].firstChild.data = "エラー";
        result_table.rows[1].cells[1].firstChild.data = "エラー";
        result_table.rows[1].cells[2].firstChild.data = "エラー";
        result_table.rows[1].cells[3].firstChild.data = "エラー";
        
    }
}